{"redis.conf": {"exclude": ["require pass", "port", "dir", "dbfilename", "appendfilename", "pidfile", "masterauth", "slaveof", "bind", "appendonly", "save", "daemonize", "logfile", "requirepass"], "include": ["/*"], "doc": [{"description": "Close the connection after a client is idle for N seconds (0 to disable)", "key": "timeout"}, {"allowed-values": "debug,verbose,notice,warning", "description": "Set server loglevel = debug|verbose|notice|warning", "key": "loglevel"}, {"description": "Specify the log file name.", "key": "logfile"}, {"description": "Set the number of databases.", "key": "databases"}, {"allowed-values": "0,1", "description": "Compress string objects using LZF when dump .rdb databases?", "key": "rdbcompression"}, {"key": "dbfilename"}, {"description": "Set the max number of connected clients at the same time. Default no limit.", "key": "maxclients"}, {"description": "Don't use more memory than the specified amount of bytes. ", "key": "maxmemory"}, {"description": "Virtual Memory allows Redis to work with datasets bigger than the actual amount of RAM needed to hold the whole dataset in memory.", "key": "vm-enabled"}, {"description": "This is the path of the Redis swap file.", "key": "vm-swap-file"}, {"description": "Configures the VM to use at max the specified amount of RAM. Vm-max-memory setting specifies how much memory Redis is free to use before starting swapping values on disk", "key": "vm-max-memory"}, {"description": "Redis swap files is split into pages. An object can be saved using multiple contiguous pages, but pages can't be shared between different objects.", "key": "vm-page-size"}, {"description": "Number of total memory pages in the swap file.", "key": "vm-pages"}, {"description": "Max number of VM I/O threads running at the same time. This threads are used to read/write data from/to swap file.", "key": "vm-max-threads"}, {"description": "Glue small output buffers together in order to send small replies in a single TCP packet.", "key": "glueoutputbuf"}, {"description": "Hashes are encoded in a special way (much more memory efficient) when they have at max a given numer of elements, and the biggest element does not exceed a given threshold.", "key": "hash-max-zipmap-entries"}, {"key": "hash-max-zipmap-value"}, {"description": "Active rehashing uses 1 millisecond every 100 milliseconds of CPU time in order to help rehashing the main Redis hash table (the one mapping top-level keys to values).", "key": "activerehashing"}]}}