{"nginx.conf": {"exclude": ["http/include", "http/server"], "include": ["http/*", "events/*"], "doc": [{"description": "If the master process is run as root, then nginx will setuid()/setgid() to USER/GROUP.", "key": "user"}, {"description": "With this option you can give to all worker processes the priority (nice) you need/wish, it calls setpriority().", "key": "worker_priority"}, {"description": "nginx has the ability to use more than one worker process", "key": "worker_processes"}, {"description": "Specifies the value for maximum file descriptors that can be opened by this process.", "key": "worker_rlimit_nofile"}, {"description": "The worker_connections and worker_proceses from the main section allows you to calculate maxclients value", "key": "events/worker_connections"}, {"description": "The first parameter assigns the timeout for keep-alive connections with the client. The server will close connections after this time.", "key": "http/keepalive_timeout"}, {"description": "Number of requests which can be made over a keep-alive connection.", "key": "http/keepalive_requests"}, {"description": "This directive allows or forbids the use of the socket option TCP_NODELAY. Only included in keep-alive connections.", "key": "http/tcp_nodelay"}, {"description": "This directive permits or forbids the use of the socket options TCP_NOPUSH on FreeBSD or TCP_CORK on Linux. This option is only available when using sendfile.", "key": "http/tcp_nopush"}, {"description": "The directive enables use of flags O_DIRECT (FreeBSD, Linux), F_NOCACHE (Mac OS X) or directio() function (Solaris) for reading files with size greater than specified. This directive disables use of sendfile for this request. This directive may be useful for big files", "key": "http/directio"}, {"description": "Directive activate or deactivate the usage of sendfile().", "key": "http/sendfile"}, {"description": "Directive assigns the maximum number and size of buffers for large headers to read from client request.", "key": "http/large_client_header_buffers"}, {"description": "Directive assigns the speed of transmission of the answer to client. Speed is assigned in the bytes per second. Limitation works only for one connection", "key": "http/limit_rate"}, {"description": "The directive limits speed only after the first part was sent.", "key": "http/limit_rate_after"}, {"description": "The directive enables or disables messages in error_log about files not found on disk.", "key": "http/log_not_found"}, {"description": "This directive enables or disables the the msie_padding feature for MSIE browsers, and Chrome (as of nginx 0.8.25+). When this is enabled, nginx will pad the size of the response body to a minimum of 512 bytes, for responses with a status code above or equal to 400.", "key": "http/msie_padding"}, {"description": "This directive allows or forbids issuing a refresh instead of doing a redirect for MSIE.", "key": "http/msie_refresh"}, {"description": "syntax: open_file_cache max = N [inactive = time] | off . The directive sets the cache activity on.", "key": "http/open_file_cache"}, {"description": "The directive specifies to cache errors or not when searching a file.", "key": "http/open_file_cache_errors"}, {"description": "The directive defines the minimum use number of a file within the time specified in the directive parameter inactive in open_file_cache.", "key": "http/open_file_cache_min_uses"}, {"description": "The directive specifies the time when need to check the validity of the information about the item in open_file_cache.", "key": "http/open_file_cache_valid"}, {"description": "Directive activates or deactivates optimization of host name checks for name-based virtual servers.", "key": "http/optimize_server_names"}, {"description": "Directive allows or prevents port indication in redirects handled by nginx.", "key": "http/port_in_redirect"}, {"description": "Directive defines DNS server address.", "key": "http/resolver"}, {"description": "Directive defines timeout for name resolution.", "key": "http/resolver_timeout"}, {"description": "root specifies the document root for the requests.", "key": "http/root"}, {"description": "Directive assigns response timeout to client. Timeout is established not on entire transfer of answer, but only between two operations of reading, if after this time client will take nothing, then nginx is shutting down the connection.", "key": "http/send_timeout"}, {"description": "If server_name_in_redirect is on, then Nginx will use the first value of the server_name directive for redirects. If server_name_in_redirect is off, then nginx will use the requested Host header.", "key": "http/server_name_in_redirect"}, {"description": "The maximum size of the server name hash tables. For more detail see the description of tuning the hash tables in http://wiki.nginx.org/Optimizations", "key": "http/server_names_hash_max_size"}, {"description": "Directive assigns the size of basket in the hash-tables of the names of servers.", "key": "http/server_names_hash_bucket_size"}, {"description": "Whether to send the Nginx version number in error pages and Server header.", "key": "http/server_tokens"}, {"description": "The directive specifies the client request body buffer size.", "key": "http/client_body_buffer_size"}, {"description": "Directive sets the read timeout for the request body from client.", "key": "http/client_body_timeout"}, {"description": "Directive sets the headerbuffer size for the request header from client.", "key": "http/client_header_buffer_size"}, {"description": "Directive assigns timeout with reading of the title of the request of client.", "key": "http/client_header_timeout"}, {"description": "Directive assigns the maximum accepted body size of client request, indicated by the line Content-Length in the header of request.", "key": "http/client_max_body_size"}, {"description": "This directive set the buffer size, into which will be read the first part of the response, obtained from the proxied server.", "key": "http/proxy_buffer_size"}, {"description": "This directive activate response buffering of the proxied server.", "key": "http/proxy_buffering"}, {"description": "This directive sets the number and the size of buffers, into which will be read the answer, obtained from the proxied server. By default, the size of one buffer is equal to the size of page.", "key": "http/proxy_buffers"}, {"description": "This directive sets name of zone for caching. The same zone can be used in multiple places.", "key": "http/proxy_cache"}, {"description": "Number of queries, after which reply will be cached.", "key": "http/proxy_cache_min_uses"}, {"allowed-values": "0-75", "description": "This directive assigns a timeout for the connection to the upstream server. It is necessary to keep in mind that this time out cannot be more than 75 seconds.", "key": "http/proxy_connect_timeout"}, {"description": "This directive sets the bucket size of the headers hash table.", "key": "http/proxy_headers_hash_bucket_size"}, {"description": "This directive sets the maximum size of the headers hash table. ", "key": "http/proxy_headers_hash_max_size"}, {"description": "Prevents aborting request to proxy in case the client itself aborts the request.", "key": "http/proxy_ignore_client_abort"}, {"allowed-values": "X-Accel-Redirect,X-Accel-Expires,Expires,Cache-Control", "description": "This directive(0.7.54+) prohibits the processing of the header lines from the proxy server's response.", "key": "http/proxy_ignore_headers"}, {"description": "This directive decides if nginx will intercept responses with HTTP status codes of 400 and higher.", "key": "http/proxy_intercept_errors"}, {"description": "The maximum size of a temporary file when the content is larger than the proxy buffer. If file is larger than this size, it will be served synchronously from upstream server rather than buffered to disk.", "key": "http/proxy_max_temp_file_size"}, {"description": "Allows you to override the HTTP method of the request to be passed to the backend server. If you specify POST for example, all requests forwarded to the backend server will be POST requests.", "key": "http/proxy_method"}, {"description": "This directive allows transferring header-lines forbidden for response.", "key": "http/proxy_pass_header"}, {"description": "Defines whether or not the request body should be passed to the proxy.", "key": "http/proxy_pass_request_body"}, {"description": "Defines whether or not the request headers should be passed to the proxy.", "key": "http/proxy_pass_request_headers"}, {"description": "This directive sets the text, which must be changed in response-header 'Location' and 'Refresh' in the response of the proxied server.", "key": "http/proxy_redirect"}, {"description": "This directive sets the read timeout for the response of the proxied server. It determines how long nginx will wait to get the response to a request. The timeout is established not for entire response, but only between two operations of reading.", "key": "http/proxy_read_timeout"}, {"description": "This directive set SO_SNDLOWAT. This directive is only available on FreeBSD", "key": "http/proxy_send_lowat"}, {"description": "This directive assigns timeout with the transfer of request to the upstream server. Timeout is established not on entire transfer of request, but only between two write operations. If after this time the upstream server will not take new data, then nginx is shutdown the connection.", "key": "http/proxy_send_timeout"}, {"description": "This directive sets the path in which upstream files are stored. The parameter 'on' preserves files in accordance with path specified in directives alias or root. The parameter 'off' forbids storing.", "key": "http/proxy_store"}, {"description": "\"This directive assigns the permissions for the created files and directories, for example: proxy_store_access  user:rw  group:rw  all:r", "key": "http/proxy_store_access"}]}}